from stopword import Stopwords

tasks = [
    "घर/जग्गा नामसारीको सिफारिस",
    "मोही लगत कट्टाको सिफारीस",
    "घर कायम सिफारीस",
    "अशक्त सिफारिस",
    "छात्रबृत्तिको लागि सिफारिस",
    "आदिवासी जनजाति प्रमाणित",
    "अस्थायी बसोबासको सिफारिस",
    "स्थायी बसोबासको सिफारिस",
    "आर्थिक अवस्था कमजोर सिफारिस",
    "नयाँ घरमा विद्युत जडान सिफारिस",
    "धारा जडान सिफारिस",
    "दुबै नाम गरेको ब्यक्ति एक्कै हो भन्ने सिफारिस",
    "ब्यवसाय बन्द सिफारिस",
    "व्यवसाय ठाउँसारी सिफारिस",
    "कोर्ट–फिमिनाहा सिफारिस",
    "नाबालक सिफारिस",
    "चौपाया सिफारिस",
    "संस्था दर्ता",
    "विद्यालय ठाउँसारी सिफारिस",
    "विद्यालय संचालन/कक्षा बृद्धिको सिफारिस",
    "जग्गा दर्ता सिफारिस",
    "संरक्षक सिफारिस",
    "बाटो कायम सिफारिस",
    "जिवित नाता प्रमाणित",
    "मृत्यु नाता प्रमाणित",
    "निःशुल्क स्वास्थ्य उपचारको लागि सिफारिस",
    "संस्था दर्ता सिफारिस",
    "घर बाटो प्रमाणित",
    "चारकिल्ला प्रमाणित गरि",
    "जन्म मिति प्रमाणित गरि",
    "बिवाह प्रमाणित",
    "घर पाताल प्रमाणित",
    "हकदार प्रमाणित",
    "अबिवाहित प्रमाणित",
    "जग्गाधनी प्रमाण पूर्जा हराएको सिफारिस",
    "व्यवसाय दर्ता",
    "मोही नामसारीको लागि सिफारिस",
    "मूल्याङ्कन",
    "तीन पुस्ते खोली सिफारिस",
    "पुरानो घरमा विद्युत जडान सिफारिस",
    "सामाजिक सुरक्षा भत्ता नाम दर्ता सम्बन्धमा",
    "बहाल समझौता",
    "कोठा खोली",
    "अपाङ्ग सिफारिस",
    "नापी नक्सामा बाटो नभएको फिल्डमा बाटो भएको सिफारिस",
    "धारा नामसारी सिफारिस",
    "विद्युत मिटर नामसारी सिफारिस",
    "फोटो टाँसको लागि तीन पुस्ते खोली सिफारिस",
    "कोठा बन्द सिफारिस",
    "अस्थाई टहराको सम्पत्ति कर तिर्न सिफारिस",
    "औषधि उपचार बापत खर्चँ भन्ने सम्वन्धमा",
    "नागरिकता र प्रतिलिपि सिफारिस",
    "अंग्रेजीमा सिफारिस"
]

""" query2 = "मलाई विशालले बित्न लाग्यो तेहि भएर मलाई संरक्षण चाहियो" """

query2 = "धारा नाम"

query = Stopwords().remove_stopwords(query2)
query = ' '.join(query)

# loop through task find jaccard similar and print the one with max value
max_similar = 0
max_task = ""

for task in tasks:
    intersection = set(query).intersection(set(task))
    union = set(query).union(set(task))
    similar = len(intersection) / len(union)
    if similar > max_similar:
        max_similar = similar
        max_task = task

print("Query:", query)
print("Most Similar Task:", max_task)